tap "homebrew/bundle"
brew "coreutils"
brew "atuin"
brew "bat"
brew "chezmoi"
brew "curl"
brew "eza"
brew "fx"
brew "fzf"
brew "ghostty"
brew "git"
brew "gnupg"
brew "jq"
brew "micro"
brew "nodenv"
brew "pnpm"
brew "powerlevel10k"
brew "rustup-init"
brew "spaceship"
brew "tldr"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "bluesnooze"
cask "discord"
cask "hiddenbar"
cask "iterm2"
cask "itsycal"
cask "middleclick"
cask "viscosity"
cask "visual-studio-code"
brew "zoxide"
vscode "astro-build.astro-vscode"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dorzey.vscode-sqlfluff"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabianlauer.vs-code-xml-format"
vscode "fabiospampinato.vscode-open-in-github"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sallar.vscode-duotone-dark"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
