tap "homebrew/bundle"
brew "coreutils"
brew "antidote"
brew "atuin"
brew "bat"
brew "chezmoi"
brew "curl"
brew "eza"
brew "fx"
brew "fzf"
brew "git"
brew "gnupg"
brew "jless"
brew "jq"
brew "lnav"
brew "micro"
brew "nodenv"
brew "pnpm"
brew "pyenv"
brew "powerlevel10k"
brew "rustup-init"
brew "spaceship"
brew "tealdeer"
brew "vivid"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "bluesnooze" if OS.mac?
cask "discord"
cask "ghostty"
cask "hiddenbar" if OS.mac?
cask "iterm2" if OS.mac?
cask "itsycal" if OS.mac?
cask "middleclick" if OS.mac?
cask "viscosity" if OS.mac?
cask "visual-studio-code"
cask "zen-browser"
vscode "astro-build.astro-vscode" if OS.mac?
vscode "christian-kohler.path-intellisense" if OS.mac?
vscode "dbaeumer.vscode-eslint" if OS.mac?
vscode "dorzey.vscode-sqlfluff" if OS.mac?
vscode "eamodio.gitlens" if OS.mac?
vscode "esbenp.prettier-vscode" if OS.mac?
vscode "fabianlauer.vs-code-xml-format" if OS.mac?
vscode "fabiospampinato.vscode-open-in-github" if OS.mac?
vscode "mechatroner.rainbow-csv" if OS.mac?
vscode "miguelsolorio.fluent-icons" if OS.mac?
vscode "mikestead.dotenv" if OS.mac?
vscode "ms-python.debugpy" if OS.mac?
vscode "ms-python.isort" if OS.mac?
vscode "ms-python.python" if OS.mac?
vscode "ms-python.vscode-pylan if OS.mac?ce" if OS.mac?
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer" if OS.mac?
vscode "sallar.vscode-duotone-dark" if OS.mac?
vscode "streetsidesoftware.code-spell-checker" if OS.mac?
vscode "tamasfe.even-better-toml" if OS.mac?
vscode "timonwong.shellcheck" if OS.mac?
vscode "unifiedjs.vscode-mdx" if OS.mac?
